Revit 2027 API
AdvancedGlazing.GlazingTransmissionRoughness Property
 The property labeled "Transmissive roughness" from the "AdvancedGlazing" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GlazingTransmissionRoughness { get; }
Public Shared ReadOnly Property GlazingTransmissionRoughness As String
	Get
public:
static property String^ GlazingTransmissionRoughness {
	String^ get ();
}
static member GlazingTransmissionRoughness : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble". This property allows a connected asset.
See Also
Reference
AdvancedGlazing Class
Autodesk.Revit.DB.Visual Namespace